#+TITLE: Ning
#+OPTIONS: toc:nil author:nil date:nil prop:t p:t
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+LATEX_HEADER: \geometry{a4paper,hmargin=0.5in,vmargin=0.5in}
*** 名字贴
:PROPERTIES:
:EXPORT_OPTIONS: toc:nil author:nil date:nil title:nil
:EXPORT_LATEX_HEADER: \usepackage{tabularray}
:EXPORT_LATEX_HEADER_EXTRA: \geometry{margin=0pt}
:END:
\newlength{\myrowheight}
\setlength{\myrowheight}{\dimexpr(\textheight-1pt)/5\relax}
\noindent
\large
\DefTblrTemplate{head,foot}{default}{}
\SetTblrInner{rowsep=0pt,colsep=0pt}
#+BEGIN_SRC emacs-lisp :var table=data-2024 col-num=4 row-num=5 :results value latex :exports results
  (let ((latex-table '())
        (col-count 0))
    (dolist (row table)
      (unless (equal 'hline row)
        (let ((name (nth 1 row))
              (id (nth 0 row)))
          (setq col-count (1+ col-count))
          (push (format "\\begin{tabular}{l} 学校：昌邑小学 \\\\ 班级：一（4）班 \\\\ 姓名：%s \\\\ 学号：%s \\end{tabular}" name id) latex-table)
          (if (< col-count col-num)
              (push " &\n" latex-table)
            (progn
              (push " \\\\\n" latex-table)
              (setq col-count 0))))))
    (format "\\begin{tblr}[long]{rows={\\myrowheight},columns={c},colspec={*{%s}{X}}}\n%s\\end{tblr}"
            col-num
            (mapconcat 'identity (reverse latex-table) "")))
#+END_SRC

#+RESULTS:
#+begin_export latex
\begin{tblr}[long]{rows={\myrowheight},columns={c},colspec={*{4}{X}}}
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：张乐欣 \\ 学号：1 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：王若筠 \\ 学号：2 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：陈欢 \\ 学号：3 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：俞欣泽 \\ 学号：4 \end{tabular} \\
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：靖星漪 \\ 学号：5 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：徐嘉怡 \\ 学号：6 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：张嘉言 \\ 学号：7 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：孙乐欣 \\ 学号：8 \end{tabular} \\
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：张瑞妍 \\ 学号：9 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：王珞妍 \\ 学号：10 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：贾沂昕 \\ 学号：11 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：贾沂怡 \\ 学号：12 \end{tabular} \\
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：唐婉 \\ 学号：13 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：鞠凡希 \\ 学号：14 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：谢梦羽 \\ 学号：15 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：程颂恩 \\ 学号：16 \end{tabular} \\
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：陈茗舒 \\ 学号：17 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：郭文真 \\ 学号：18 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：鲁一笑 \\ 学号：19 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：龚容若 \\ 学号：20 \end{tabular} \\
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：栗梓壹 \\ 学号：21 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：王越 \\ 学号：22 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：吴可非 \\ 学号：24 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：俞昊泽 \\ 学号：25 \end{tabular} \\
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：张博宸 \\ 学号：26 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：唐奕淏 \\ 学号：27 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：钟昕辰 \\ 学号：28 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：汲瑞麟 \\ 学号：29 \end{tabular} \\
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：郑尚轩 \\ 学号：30 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：常文赫 \\ 学号：31 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：陈沐青 \\ 学号：32 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：吴恒屹 \\ 学号：33 \end{tabular} \\
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：吴宸宇 \\ 学号：34 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：钱锦弘 \\ 学号：35 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：钱宸瑜 \\ 学号：36 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：何宇成 \\ 学号：37 \end{tabular} \\
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：向东生 \\ 学号：38 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：顾允珵 \\ 学号：39 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：徐怀仁 \\ 学号：40 \end{tabular} &
\begin{tabular}{l} 学校：昌邑小学 \\ 班级：一（4）班 \\ 姓名：程砚书 \\ 学号：41 \end{tabular} \\
\end{tblr}
#+end_export
